In [1]:
import pandas as pd
years = [18, 19, 20, 21, 22, 23, 24, 25]
headers = [
    "transaction_id",
    "price",
    "date_of_transfer",
    "postcode",
    "property_type",
    "new_build_flag",
    "tenure_type",
    "primary_addressable_object_name",
    "secondary_addressable_object_name",
    "street",
    "locality",
    "town_city",
    "district",
    "county",
    "ppd_category_type",
    "record_status"
]
drop = [
    "transaction_id",
    "primary_addressable_object_name",
    "secondary_addressable_object_name",
    "street",
    "locality",
    "ppd_category_type",
    "record_status"
]
dfs = {}
for year in years:
    url = f"http://prod.publicdata.landregistry.gov.uk.s3-website-eu-west-1.amazonaws.com/pp-20{year}.csv"
    df = pd.read_csv(url)
    df.columns = headers
    df = df.drop(columns=drop)
    dfs[f"df20{year}"] = df
    print(f"{year} done")
dfs

18 done
19 done
20 done
21 done
22 done

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18140\2815900718.py:33: DtypeWarning: Columns (7,8) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(url)

23 done
24 done
25 done

{'df2018':           price  date_of_transfer  postcode property_type new_build_flag  \
 0        253500  2018-09-24 00:00    M6 8GQ             D              N
 1        231950  2018-09-28 00:00   WA3 2UE             D              Y
 2        112500  2018-08-29 00:00   OL6 6RJ             S              N
 3        184995  2018-06-15 00:00   M46 0TW             S              Y
 4        214995  2018-09-28 00:00   M28 3XS             D              Y
 ...         ...               ...       ...           ...            ...
 1037248  100000  2018-11-16 00:00   DH4 7HW             T              N
 1037249  334950  2018-11-30 00:00  NE31 1BF             D              Y
 1037250  106010  2018-12-12 00:00   NE2 1NY             F              N
 1037251  144995  2018-07-26 00:00  NE27 0JA             T              Y
 1037252  334950  2018-07-13 00:00  NE15 9BW             D              Y

         tenure_type            town_city             district  \
 0                 F              SALFORD              SALFORD
 1                 F           WARRINGTON                WIGAN
 2                 F    ASHTON-UNDER-LYNE             TAMESIDE
 3                 F           MANCHESTER                WIGAN
 4                 L           MANCHESTER              SALFORD
 ...             ...                  ...                  ...
 1037248           F   HOUGHTON LE SPRING           SUNDERLAND
 1037249           F              HEBBURN       SOUTH TYNESIDE
 1037250           L  NEWCASTLE UPON TYNE  NEWCASTLE UPON TYNE
 1037251           F  NEWCASTLE UPON TYNE       NORTH TYNESIDE
 1037252           F  NEWCASTLE UPON TYNE  NEWCASTLE UPON TYNE

                      county
 0        GREATER MANCHESTER
 1        GREATER MANCHESTER
 2        GREATER MANCHESTER
 3        GREATER MANCHESTER
 4        GREATER MANCHESTER
 ...                     ...
 1037248       TYNE AND WEAR
 1037249       TYNE AND WEAR
 1037250       TYNE AND WEAR
 1037251       TYNE AND WEAR
 1037252       TYNE AND WEAR

 [1037253 rows x 9 columns],
 'df2019':            price  date_of_transfer  postcode property_type new_build_flag  \
 0         116000  2019-06-07 00:00    L9 1DZ             T              N
 1          60000  2019-05-23 00:00    L4 0RS             T              N
 2         192000  2019-05-24 00:00   WA3 1EP             D              N
 3         166000  2019-06-07 00:00   PR1 0YA             S              N
 4         135000  2019-05-03 00:00    L7 8RU             T              N
 ...          ...               ...       ...           ...            ...
 1011548   680000  2019-12-20 00:00   CR2 7LA             D              N
 1011549   635000  2019-09-02 00:00   CR0 1JS             S              N
 1011550   333000  2019-12-20 00:00  KT15 2PX             S              N
 1011551  1590430  2019-11-16 00:00   CR3 7DD             D              N
 1011552   585000  2019-12-19 00:00   KT4 8NP             T              N

         tenure_type       town_city      district              county
 0                 F       LIVERPOOL     LIVERPOOL          MERSEYSIDE
 1                 F       LIVERPOOL     LIVERPOOL          MERSEYSIDE
 2                 L      WARRINGTON         WIGAN  GREATER MANCHESTER
 3                 F         PRESTON  SOUTH RIBBLE          LANCASHIRE
 4                 F       LIVERPOOL     LIVERPOOL          MERSEYSIDE
 ...             ...             ...           ...                 ...
 1011548           F   SOUTH CROYDON       CROYDON      GREATER LONDON
 1011549           F         CROYDON       CROYDON      GREATER LONDON
 1011550           F      ADDLESTONE     RUNNYMEDE              SURREY
 1011551           F        CATERHAM     TANDRIDGE              SURREY
 1011552           F  WORCESTER PARK        SUTTON      GREATER LONDON

 [1011553 rows x 9 columns],
 'df2020':          price  date_of_transfer  postcode property_type new_build_flag  \
 0       500000  2020-11-27 00:00  IP13 9FG             D              N
 1       142000  2020-12-07 00:00  IP28 7JL             F              N
 2       142000  2020-11-27 00:00  IP33 3SH             F              N
 3       175000  2020-11-09 00:00  NR33 7HR             T              N
 4       245000  2020-12-18 00:00   IP5 1LY             S              N
 ...        ...               ...       ...           ...            ...
 895993  239995  2020-01-10 00:00   IP8 4HT             T              N
 895994  300000  2020-01-10 00:00   IP6 8ES             D              N
 895995  225000  2020-01-06 00:00  IP29 5AD             S              N
 895996  205000  2020-01-03 00:00  NR33 7QY             S              N
 895997  185000  2020-01-17 00:00  IP12 2HR             T              N

        tenure_type        town_city      district   county
 0                F       WOODBRIDGE  EAST SUFFOLK  SUFFOLK
 1                L  BURY ST EDMUNDS  WEST SUFFOLK  SUFFOLK
 2                L  BURY ST EDMUNDS  WEST SUFFOLK  SUFFOLK
 3                F        LOWESTOFT  EAST SUFFOLK  SUFFOLK
 4                F          IPSWICH  EAST SUFFOLK  SUFFOLK
 ...            ...              ...           ...      ...
 895993           F          IPSWICH   MID SUFFOLK  SUFFOLK
 895994           F          IPSWICH   MID SUFFOLK  SUFFOLK
 895995           F  BURY ST EDMUNDS  WEST SUFFOLK  SUFFOLK
 895996           F        LOWESTOFT  EAST SUFFOLK  SUFFOLK
 895997           F       WOODBRIDGE  EAST SUFFOLK  SUFFOLK

 [895998 rows x 9 columns],
 'df2021':           price  date_of_transfer  postcode property_type new_build_flag  \
 0        477000  2021-05-10 00:00  BN16 2PQ             D              N
 1        370000  2021-05-06 00:00   BN2 4HZ             T              N
 2        462500  2021-04-28 00:00   BN2 0GP             T              N
 3        433000  2021-08-06 00:00   BN8 4LS             D              N
 4        676000  2021-08-05 00:00   BN1 6NB             T              N
 ...         ...               ...       ...           ...            ...
 1278710  158000  2021-12-17 00:00   NN2 7RA             T              N
 1278711  105000  2021-05-26 00:00  NN11 9AU             F              N
 1278712  239000  2021-10-05 00:00   NN1 3JE             T              N
 1278713  190000  2021-09-08 00:00  NN18 8QS             T              N
 1278714  210000  2021-10-05 00:00   NN1 3RN             T              N

         tenure_type      town_city                district  \
 0                 F  LITTLEHAMPTON                    ARUN
 1                 F       BRIGHTON       BRIGHTON AND HOVE
 2                 F       BRIGHTON       BRIGHTON AND HOVE
 3                 F          LEWES                   LEWES
 4                 F       BRIGHTON       BRIGHTON AND HOVE
 ...             ...            ...                     ...
 1278710           F    NORTHAMPTON   WEST NORTHAMPTONSHIRE
 1278711           L       DAVENTRY   WEST NORTHAMPTONSHIRE
 1278712           F    NORTHAMPTON   WEST NORTHAMPTONSHIRE
 1278713           F          CORBY  NORTH NORTHAMPTONSHIRE
 1278714           F    NORTHAMPTON   WEST NORTHAMPTONSHIRE

                          county
 0                   WEST SUSSEX
 1             BRIGHTON AND HOVE
 2             BRIGHTON AND HOVE
 3                   EAST SUSSEX
 4             BRIGHTON AND HOVE
 ...                         ...
 1278710   WEST NORTHAMPTONSHIRE
 1278711   WEST NORTHAMPTONSHIRE
 1278712   WEST NORTHAMPTONSHIRE
 1278713  NORTH NORTHAMPTONSHIRE
 1278714   WEST NORTHAMPTONSHIRE

 [1278715 rows x 9 columns],
 'df2022':           price  date_of_transfer  postcode property_type new_build_flag  \
 0        357000  2022-05-27 00:00   LU7 3QS             S              Y
 1        372950  2022-04-28 00:00   LU5 6TD             S              Y
 2        570000  2022-05-31 00:00  SG18 9RF             D              Y
 3        570000  2022-05-27 00:00   LU7 3QS             D              Y
 4        400500  2022-04-01 00:00   LU7 3FZ             S              Y
 ...         ...               ...       ...           ...            ...
 1071636  166500  2022-07-29 00:00   NG4 2NS             T              N
 1071637  595000  2022-07-08 00:00  LE14 3BQ             D              N
 1071638  260000  2022-03-15 00:00   NG9 5LF             S              N
 1071639  250000  2022-07-19 00:00   NG5 8FZ             D              N
 1071640  166000  2022-07-21 00:00  NG15 7EE             S              N

         tenure_type         town_city              district  \
 0                 F  LEIGHTON BUZZARD  CENTRAL BEDFORDSHIRE
 1                 F         DUNSTABLE  CENTRAL BEDFORDSHIRE
 2                 F       BIGGLESWADE  CENTRAL BEDFORDSHIRE
 3                 F  LEIGHTON BUZZARD  CENTRAL BEDFORDSHIRE
 4                 F  LEIGHTON BUZZARD  CENTRAL BEDFORDSHIRE
 ...             ...               ...                   ...
 1071636           F        NOTTINGHAM               GEDLING
 1071637           F    MELTON MOWBRAY            RUSHCLIFFE
 1071638           F        NOTTINGHAM              BROXTOWE
 1071639           F        NOTTINGHAM               GEDLING
 1071640           F        NOTTINGHAM              ASHFIELD

                        county
 0        CENTRAL BEDFORDSHIRE
 1        CENTRAL BEDFORDSHIRE
 2        CENTRAL BEDFORDSHIRE
 3        CENTRAL BEDFORDSHIRE
 4        CENTRAL BEDFORDSHIRE
 ...                       ...
 1071636       NOTTINGHAMSHIRE
 1071637       NOTTINGHAMSHIRE
 1071638       NOTTINGHAMSHIRE
 1071639       NOTTINGHAMSHIRE
 1071640       NOTTINGHAMSHIRE

 [1071641 rows x 9 columns],
 'df2023':          price  date_of_transfer  postcode property_type new_build_flag  \
 0       125000  2023-10-20 00:00   B44 8BN             T              N
 1       495000  2023-09-29 00:00   B31 2HS             S              N
 2       110000  2023-12-19 00:00   CV1 2AW             T              N
 3       170000  2023-02-27 00:00   B36 0QE             T              N
 4       110000  2023-10-04 00:00   B26 3BN             T              N
 ...        ...               ...       ...           ...            ...
 851966  172500  2023-03-03 00:00   CM8 2AW             F              N
 851967  375000  2023-08-17 00:00   CM8 2DJ             S              N
 851968  610000  2023-08-22 00:00   CO3 3NR             D              N
 851969  525000  2023-07-31 00:00  CM15 9NP             S              N
 851970  326000  2023-07-28 00:00  SS13 1JH             S              N

        tenure_type   town_city    district         county
 0                F  BIRMINGHAM  BIRMINGHAM  WEST MIDLANDS
 1                F  BIRMINGHAM  BIRMINGHAM  WEST MIDLANDS
 2                F    COVENTRY    COVENTRY  WEST MIDLANDS
 3                F  BIRMINGHAM    SOLIHULL  WEST MIDLANDS
 4                F  BIRMINGHAM  BIRMINGHAM  WEST MIDLANDS
 ...            ...         ...         ...            ...
 851966           L      WITHAM   BRAINTREE          ESSEX
 851967           F      WITHAM   BRAINTREE          ESSEX
 851968           F  COLCHESTER  COLCHESTER          ESSEX
 851969           F   BRENTWOOD   BRENTWOOD          ESSEX
 851970           F    BASILDON    BASILDON          ESSEX

 [851971 rows x 9 columns],
 'df2024':          price  date_of_transfer  postcode property_type new_build_flag  \
 0       210000  2024-04-05 00:00  LL55 1DL             S              N
 1       485000  2024-04-19 00:00   SA3 2EQ             D              N
 2       135000  2024-04-15 00:00  NP12 0PR             T              N
 3       120000  2024-03-19 00:00  SA69 9NL             F              N
 4       125000  2024-03-25 00:00  SA12 6UP             S              N
 ...        ...               ...       ...           ...            ...
 820459  300000  2024-02-02 00:00   OX7 5EB             T              N
 820460  640000  2024-07-11 00:00   OX4 4XQ             T              N
 820461  600000  2024-07-19 00:00  OX11 9NX             D              N
 820462  495000  2024-06-19 00:00  OX25 4NE             S              N
 820463  310000  2024-05-07 00:00   OX3 8LX             T              N

        tenure_type        town_city             district             county
 0                F       CAERNARFON              GWYNEDD            GWYNEDD
 1                F          SWANSEA              SWANSEA            SWANSEA
 2                F        BLACKWOOD           CAERPHILLY         CAERPHILLY
 3                L     SAUNDERSFOOT        PEMBROKESHIRE      PEMBROKESHIRE
 4                F      PORT TALBOT    NEATH PORT TALBOT  NEATH PORT TALBOT
 ...            ...              ...                  ...                ...
 820459           F  CHIPPING NORTON     WEST OXFORDSHIRE        OXFORDSHIRE
 820460           F           OXFORD               OXFORD        OXFORDSHIRE
 820461           F           DIDCOT  VALE OF WHITE HORSE        OXFORDSHIRE
 820462           F         BICESTER             CHERWELL        OXFORDSHIRE
 820463           F           OXFORD               OXFORD        OXFORDSHIRE

 [820464 rows x 9 columns],
 'df2025':          price  date_of_transfer  postcode property_type new_build_flag  \
 0       245000  2025-02-28 00:00   HR4 0HH             T              N
 1       270000  2025-02-13 00:00   WR5 3AS             S              N
 2       943000  2025-02-20 00:00   B48 7QA             D              N
 3       303000  2025-02-14 00:00   WR3 7PF             S              N
 4       870000  2025-01-29 00:00   B45 8NX             D              N
 ...        ...               ...       ...           ...            ...
 252142   98000  2025-01-17 00:00   NN4 8SA             F              N
 252143  120000  2025-01-24 00:00  NN16 0SE             F              N
 252144  604500  2025-01-14 00:00  NN10 0NB             O              N
 252145  133650  2025-01-10 00:00   NN4 8TE             F              N
 252146  332000  2025-01-27 00:00  NN15 5YL             D              N

        tenure_type    town_city                district  \
 0                F     HEREFORD           HEREFORDSHIRE
 1                F    WORCESTER               WORCESTER
 2                F   BIRMINGHAM              BROMSGROVE
 3                F    WORCESTER               WORCESTER
 4                F   BIRMINGHAM              BROMSGROVE
 ...            ...          ...                     ...
 252142           L  NORTHAMPTON   WEST NORTHAMPTONSHIRE
 252143           L    KETTERING  NORTH NORTHAMPTONSHIRE
 252144           F      RUSHDEN  NORTH NORTHAMPTONSHIRE
 252145           L  NORTHAMPTON   WEST NORTHAMPTONSHIRE
 252146           F    KETTERING  NORTH NORTHAMPTONSHIRE

                         county
 0                HEREFORDSHIRE
 1               WORCESTERSHIRE
 2               WORCESTERSHIRE
 3               WORCESTERSHIRE
 4               WORCESTERSHIRE
 ...                        ...
 252142   WEST NORTHAMPTONSHIRE
 252143  NORTH NORTHAMPTONSHIRE
 252144  NORTH NORTHAMPTONSHIRE
 252145   WEST NORTHAMPTONSHIRE
 252146  NORTH NORTHAMPTONSHIRE

 [252147 rows x 9 columns]}

In [2]:
df_full = pd.concat(dfs)

In [3]:
df_full['Price (Thousands)'] = df_full['price'] / 1000
df_full.drop(columns=['price'], inplace=True)
df_full.describe()

       Price (Thousands)
count       7.219742e+06
mean        3.818475e+02
std         1.711452e+03
min         1.000000e-03
25%         1.650000e+02
50%         2.600000e+02
75%         4.000000e+02
max         9.000000e+05

In [4]:
df_full.isna().sum()

date_of_transfer         0
postcode             24503
property_type            0
new_build_flag           0
tenure_type              0
town_city                0
district                 0
county                   0
Price (Thousands)        0
dtype: int64

In [5]:
df_clean = df_full.dropna(axis=0)
df_clean.describe()

       Price (Thousands)
count       7.195239e+06
mean        3.794882e+02
std         1.660432e+03
min         1.000000e-03
25%         1.650000e+02
50%         2.600000e+02
75%         4.000000e+02
max         9.000000e+05

In [6]:
df_clean.head()

          date_of_transfer postcode property_type new_build_flag tenure_type  \
df2018 0  2018-09-24 00:00   M6 8GQ             D              N           F
       1  2018-09-28 00:00  WA3 2UE             D              Y           F
       2  2018-08-29 00:00  OL6 6RJ             S              N           F
       3  2018-06-15 00:00  M46 0TW             S              Y           F
       4  2018-09-28 00:00  M28 3XS             D              Y           L

                  town_city  district              county  Price (Thousands)
df2018 0            SALFORD   SALFORD  GREATER MANCHESTER            253.500
       1         WARRINGTON     WIGAN  GREATER MANCHESTER            231.950
       2  ASHTON-UNDER-LYNE  TAMESIDE  GREATER MANCHESTER            112.500
       3         MANCHESTER     WIGAN  GREATER MANCHESTER            184.995
       4         MANCHESTER   SALFORD  GREATER MANCHESTER            214.995

In [7]:
df_binary = pd.get_dummies(df_clean, dtype=int, columns=['tenure_type','new_build_flag', 'property_type'])
df_binary.rename(columns={'date_of_transfer':'Transfer Date','town_city':'Town/City','district':'District','county':'County','tenure_type_F':'Freehold Tenure','tenure_type_L':'Leasehold Tenure','new_build_flag_N':'Old Build','new_build_flag_Y':'New Build','property_type_D':'Detached', 'property_type_F':'Flat', 'property_type_O':'Other Property Type','property_type_S':'Semi-detached','property_type_T':'Terraced', 'postcode':'Postcode'}, inplace=True)
df_binary.head()

             Transfer Date Postcode          Town/City  District  \
df2018 0  2018-09-24 00:00   M6 8GQ            SALFORD   SALFORD
       1  2018-09-28 00:00  WA3 2UE         WARRINGTON     WIGAN
       2  2018-08-29 00:00  OL6 6RJ  ASHTON-UNDER-LYNE  TAMESIDE
       3  2018-06-15 00:00  M46 0TW         MANCHESTER     WIGAN
       4  2018-09-28 00:00  M28 3XS         MANCHESTER   SALFORD

                      County  Price (Thousands)  Freehold Tenure  \
df2018 0  GREATER MANCHESTER            253.500                1
       1  GREATER MANCHESTER            231.950                1
       2  GREATER MANCHESTER            112.500                1
       3  GREATER MANCHESTER            184.995                1
       4  GREATER MANCHESTER            214.995                0

          Leasehold Tenure  Old Build  New Build  Detached  Flat  \
df2018 0                 0          1          0         1     0
       1                 0          0          1         1     0
       2                 0          1          0         0     0
       3                 0          0          1         0     0
       4                 1          0          1         1     0

          Other Property Type  Semi-detached  Terraced
df2018 0                    0              0         0
       1                    0              0         0
       2                    0              1         0
       3                    0              1         0
       4                    0              0         0

In [8]:
df_binary['Transfer Date'] = pd.to_datetime(df_binary['Transfer Date'], errors='coerce')
df_binary['Year'] = df_binary['Transfer Date'].dt.year
df_binary['Month'] = df_binary['Transfer Date'].dt.month
df_binary['Quarter'] = df_binary['Transfer Date'].dt.quarter
df_binary['Day of the Week'] = df_binary['Transfer Date'].dt.dayofweek
df_binary['Transfer Date'] = df_binary['Transfer Date'].astype(str).str[:10]
df_binary.tail()

              Transfer Date  Postcode    Town/City                District  \
df2025 252142    2025-01-17   NN4 8SA  NORTHAMPTON   WEST NORTHAMPTONSHIRE
       252143    2025-01-24  NN16 0SE    KETTERING  NORTH NORTHAMPTONSHIRE
       252144    2025-01-14  NN10 0NB      RUSHDEN  NORTH NORTHAMPTONSHIRE
       252145    2025-01-10   NN4 8TE  NORTHAMPTON   WEST NORTHAMPTONSHIRE
       252146    2025-01-27  NN15 5YL    KETTERING  NORTH NORTHAMPTONSHIRE

                               County  Price (Thousands)  Freehold Tenure  \
df2025 252142   WEST NORTHAMPTONSHIRE              98.00                0
       252143  NORTH NORTHAMPTONSHIRE             120.00                0
       252144  NORTH NORTHAMPTONSHIRE             604.50                1
       252145   WEST NORTHAMPTONSHIRE             133.65                0
       252146  NORTH NORTHAMPTONSHIRE             332.00                1

               Leasehold Tenure  Old Build  New Build  Detached  Flat  \
df2025 252142                 1          1          0         0     1
       252143                 1          1          0         0     1
       252144                 0          1          0         0     0
       252145                 1          1          0         0     1
       252146                 0          1          0         1     0

               Other Property Type  Semi-detached  Terraced  Year  Month  \
df2025 252142                    0              0         0  2025      1
       252143                    0              0         0  2025      1
       252144                    1              0         0  2025      1
       252145                    0              0         0  2025      1
       252146                    0              0         0  2025      1

               Quarter  Day of the Week
df2025 252142        1                4
       252143        1                4
       252144        1                1
       252145        1                4
       252146        1                0

In [9]:
df_binary.shape

(7195239, 19)

In [10]:
print(df_binary.dtypes)
print(df_binary.nunique())

Transfer Date           object
Postcode                object
Town/City               object
District                object
County                  object
Price (Thousands)      float64
Freehold Tenure          int64
Leasehold Tenure         int64
Old Build                int64
New Build                int64
Detached                 int64
Flat                     int64
Other Property Type      int64
Semi-detached            int64
Terraced                 int64
Year                     int32
Month                    int32
Quarter                  int32
Day of the Week          int32
dtype: object
Transfer Date             2731
Postcode               1162297
Town/City                 1150
District                   361
County                     117
Price (Thousands)       143229
Freehold Tenure              2
Leasehold Tenure             2
Old Build                    2
New Build                    2
Detached                     2
Flat                         2
Other Property Type          2
Semi-detached                2
Terraced                     2
Year                         8
Month                       12
Quarter                      4
Day of the Week              7
dtype: int64

In [11]:
df_binary['Postcode Area'] = df_binary['Postcode'].str.extract(r'^([A-Z]+)')
df_binary['Postcode District'] = df_binary['Postcode'].str.extract(r'^([A-Z]+[0-9]+)')
df_binary.head()

         Transfer Date Postcode          Town/City  District  \
df2018 0    2018-09-24   M6 8GQ            SALFORD   SALFORD
       1    2018-09-28  WA3 2UE         WARRINGTON     WIGAN
       2    2018-08-29  OL6 6RJ  ASHTON-UNDER-LYNE  TAMESIDE
       3    2018-06-15  M46 0TW         MANCHESTER     WIGAN
       4    2018-09-28  M28 3XS         MANCHESTER   SALFORD

                      County  Price (Thousands)  Freehold Tenure  \
df2018 0  GREATER MANCHESTER            253.500                1
       1  GREATER MANCHESTER            231.950                1
       2  GREATER MANCHESTER            112.500                1
       3  GREATER MANCHESTER            184.995                1
       4  GREATER MANCHESTER            214.995                0

          Leasehold Tenure  Old Build  New Build  ...  Flat  \
df2018 0                 0          1          0  ...     0
       1                 0          0          1  ...     0
       2                 0          1          0  ...     0
       3                 0          0          1  ...     0
       4                 1          0          1  ...     0

          Other Property Type  Semi-detached  Terraced  Year  Month  Quarter  \
df2018 0                    0              0         0  2018      9        3
       1                    0              0         0  2018      9        3
       2                    0              1         0  2018      8        3
       3                    0              1         0  2018      6        2
       4                    0              0         0  2018      9        3

          Day of the Week  Postcode Area Postcode District
df2018 0                0              M                M6
       1                4             WA               WA3
       2                2             OL               OL6
       3                4              M               M46
       4                4              M               M28

[5 rows x 21 columns]

In [30]:
df_avg_pc = df_binary.groupby('Postcode Area')['Price (Thousands)'].mean().reset_index()
df_avg_pc.columns = ['Postcode Area', 'Area Code Average Price (Thousands)']
df_avg_county = df_binary.groupby('County')['Price (Thousands)'].mean().reset_index()
df_avg_county.columns = ['County', 'County Average Price (Thousands)']
df_avg_tc = df_binary.groupby('Town/City')['Price (Thousands)'].mean().reset_index()
df_avg_tc.columns = ['Town/City', 'Town/City Average Price (Thousands)']
df_avg_dist = df_binary.groupby('District')['Price (Thousands)'].mean().reset_index()
df_avg_dist.columns = ['District', 'District Average Price (Thousands)']
df_avg_pc.head()

  Postcode Area  Area Code Average Price (Thousands)
0            AL                           624.364499
1             B                           302.164939
2            BA                           397.046740
3            BB                           186.553792
4            BD                           198.704839

In [31]:
df_merge = df_binary.merge(df_avg_pc, on=['Postcode Area'], how='left')
df_merge = df_merge.merge(df_avg_tc, on=['Town/City'], how='left')
df_merge = df_merge.merge(df_avg_dist, on=['District'], how='left')
df_merge = df_merge.merge(df_avg_county, on=['County'], how='left')
df_merge.head()

,Transfer Date,Postcode,Town/City,District,County,Price (Thousands),Freehold Tenure,Leasehold Tenure,Old Build,New Build,...,Year,Month,Quarter,Day of the Week,Postcode Area,Postcode District,Area Code Average Price (Thousands),Town/City Average Price (Thousands),District Average Price (Thousands),County Average Price (Thousands)
0,2018-09-24,M6 8GQ,SALFORD,SALFORD,GREATER MANCHESTER,253.500,1,0,1,0,...,2018,9,3,0,M,M6,286.373466,261.292260,253.098761,262.010594
1,2018-09-28,WA3 2UE,WARRINGTON,WIGAN,GREATER MANCHESTER,231.950,1,0,0,1,...,2018,9,3,4,WA,WA3,301.647233,289.308785,193.246849,262.010594
2,2018-08-29,OL6 6RJ,ASHTON-UNDER-LYNE,TAMESIDE,GREATER MANCHESTER,112.500,1,0,1,0,...,2018,8,3,2,OL,OL6,197.639388,183.803044,196.658531,262.010594
3,2018-06-15,M46 0TW,MANCHESTER,WIGAN,GREATER MANCHESTER,184.995,1,0,0,1,...,2018,6,2,4,M,M46,286.373466,285.381745,193.246849,262.010594
4,2018-09-28,M28 3XS,MANCHESTER,SALFORD,GREATER MANCHESTER,214.995,0,1,0,1,...,2018,9,3,4,M,M28,286.373466,285.381745,253.098761,262.010594

In [33]:
loc_df = pd.read_csv('ONSPD_Online_Latest_Centroids.csv')
loc_df.head()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18140\1580054128.py:1: DtypeWarning: Columns (34,42,47,55) have mixed types. Specify dtype option on import or set low_memory=False.
  loc_df = pd.read_csv('ONSPD_Online_Latest_Centroids.csv')

,X,Y,OBJECTID,PCD,PCD2,PCDS,DOINTR,DOTERM,OSCTY,CED,...,LEP2,PFA,IMD,CALNCV,ICB,OA21,LSOA21,MSOA21,RUC21IND,GlobalID
0,385386.0,801193.0,1,AB1 0AA,AB1 0AA,AB1 0AA,198001,199606.0,S99999999,S99999999,...,NaN,S23000009,6715,S99999999,S99999999,S00137176,S01013490,S02002516,NaN,b2d74491-a06c-4dd0-be0d-3f3fd5997475
1,385177.0,801314.0,2,AB1 0AB,AB1 0AB,AB1 0AB,198001,199606.0,S99999999,S99999999,...,NaN,S23000009,6715,S99999999,S99999999,S00137176,S01013490,S02002516,NaN,83e9e27a-724a-4020-9cf0-d87eff5872e8
2,385053.0,801092.0,3,AB1 0AD,AB1 0AD,AB1 0AD,198001,199606.0,S99999999,S99999999,...,NaN,S23000009,6715,S99999999,S99999999,S00137176,S01013490,S02002516,NaN,994eb987-1286-4c7f-b16b-87d03f6b0dec
3,384600.0,799300.0,4,AB1 0AE,AB1 0AE,AB1 0AE,199402,199606.0,S99999999,S99999999,...,NaN,S23000009,5069,S99999999,S99999999,S00138891,S01013856,S02002577,NaN,fd4a2772-2414-4d69-ba99-311e90df23d5
4,384460.0,800660.0,5,AB1 0AF,AB1 0AF,AB1 0AF,199012,199207.0,S99999999,S99999999,...,NaN,S23000009,6253,S99999999,S99999999,S00137241,S01013487,S02002515,NaN,270fcb01-bcda-42fc-8c38-6fdea1c3d1a3

In [35]:
loc_df.columns

Index(['X', 'Y', 'OBJECTID', 'PCD', 'PCD2', 'PCDS', 'DOINTR', 'DOTERM',
       'OSCTY', 'CED', 'OSLAUA', 'OSWARD', 'PARISH', 'USERTYPE', 'OSEAST1M',
       'OSNRTH1M', 'OSGRDIND', 'OSHLTHAU', 'NHSER', 'CTRY', 'RGN', 'STREG',
       'PCON', 'EER', 'TECLEC', 'TTWA', 'PCT', 'ITL', 'STATSWARD', 'OA01',
       'CASWARD', 'NPARK', 'LSOA01', 'MSOA01', 'UR01IND', 'OAC01', 'OA11',
       'LSOA11', 'MSOA11', 'WZ11', 'SICBL', 'BUA24', 'RU11IND', 'OAC11', 'LAT',
       'LONG', 'LEP1', 'LEP2', 'PFA', 'IMD', 'CALNCV', 'ICB', 'OA21', 'LSOA21',
       'MSOA21', 'RUC21IND', 'GlobalID'],
      dtype='object')

In [44]:
loc_df_drop = loc_df[['LAT','LONG','PCDS','OSEAST1M','OSNRTH1M']]
loc_df_drop.rename(columns={'PCDS':'Postcode'}, inplace=True)
loc_df_drop.head()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18140\1127414209.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  loc_df_drop.rename(columns={'PCDS':'Postcode'}, inplace=True)

        LAT      LONG Postcode  OSEAST1M  OSNRTH1M
0  57.10146 -2.242858  AB1 0AA  385386.0  801193.0
1  57.10254 -2.246315  AB1 0AB  385177.0  801314.0
2  57.10054 -2.248349  AB1 0AD  385053.0  801092.0
3  57.08443 -2.255714  AB1 0AE  384600.0  799300.0
4  57.09664 -2.258109  AB1 0AF  384460.0  800660.0

In [43]:
loc_house_df = df_merge.merge(loc_df_drop, on=['Postcode'], how='left')
loc_house_df.head()

,Transfer Date,Postcode,Town/City,District,County,Price (Thousands),Freehold Tenure,Leasehold Tenure,Old Build,New Build,...,Postcode Area,Postcode District,Area Code Average Price (Thousands),Town/City Average Price (Thousands),District Average Price (Thousands),County Average Price (Thousands),LAT,LONG,OSEAST1M,OSNRTH1M
0,2018-09-24,M6 8GQ,SALFORD,SALFORD,GREATER MANCHESTER,253.500,1,0,1,0,...,M,M6,286.373466,261.292260,253.098761,262.010594,53.49295,-2.311376,379439.0,399626.0
1,2018-09-28,WA3 2UE,WARRINGTON,WIGAN,GREATER MANCHESTER,231.950,1,0,0,1,...,WA,WA3,301.647233,289.308785,193.246849,262.010594,53.46955,-2.583977,361332.0,397136.0
2,2018-08-29,OL6 6RJ,ASHTON-UNDER-LYNE,TAMESIDE,GREATER MANCHESTER,112.500,1,0,1,0,...,OL,OL6,197.639388,183.803044,196.658531,262.010594,53.48984,-2.074338,395165.0,399237.0
3,2018-06-15,M46 0TW,MANCHESTER,WIGAN,GREATER MANCHESTER,184.995,1,0,0,1,...,M,M46,286.373466,285.381745,193.246849,262.010594,53.52589,-2.495181,367270.0,403360.0
4,2018-09-28,M28 3XS,MANCHESTER,SALFORD,GREATER MANCHESTER,214.995,0,1,0,1,...,M,M28,286.373466,285.381745,253.098761,262.010594,53.51677,-2.411523,372810.0,402310.0

In [45]:
loc_house_df.isna().sum()

Transfer Date                            0
Postcode                                 0
Town/City                                0
District                                 0
County                                   0
Price (Thousands)                        0
Freehold Tenure                          0
Leasehold Tenure                         0
Old Build                                0
New Build                                0
Detached                                 0
Flat                                     0
Other Property Type                      0
Semi-detached                            0
Terraced                                 0
Year                                     0
Month                                    0
Quarter                                  0
Day of the Week                          0
Postcode Area                            0
Postcode District                        0
Area Code Average Price (Thousands)      0
Town/City Average Price (Thousands)      0
District Average Price (Thousands)       0
County Average Price (Thousands)         0
LAT                                    356
LONG                                   356
OSEAST1M                               356
OSNRTH1M                               356
dtype: int64

In [46]:
loc_house_df.dropna(axis=0)

,Transfer Date,Postcode,Town/City,District,County,Price (Thousands),Freehold Tenure,Leasehold Tenure,Old Build,New Build,...,Postcode Area,Postcode District,Area Code Average Price (Thousands),Town/City Average Price (Thousands),District Average Price (Thousands),County Average Price (Thousands),LAT,LONG,OSEAST1M,OSNRTH1M
0,2018-09-24,M6 8GQ,SALFORD,SALFORD,GREATER MANCHESTER,253.500,1,0,1,0,...,M,M6,286.373466,261.292260,253.098761,262.010594,53.49295,-2.311376,379439.0,399626.0
1,2018-09-28,WA3 2UE,WARRINGTON,WIGAN,GREATER MANCHESTER,231.950,1,0,0,1,...,WA,WA3,301.647233,289.308785,193.246849,262.010594,53.46955,-2.583977,361332.0,397136.0
2,2018-08-29,OL6 6RJ,ASHTON-UNDER-LYNE,TAMESIDE,GREATER MANCHESTER,112.500,1,0,1,0,...,OL,OL6,197.639388,183.803044,196.658531,262.010594,53.48984,-2.074338,395165.0,399237.0
3,2018-06-15,M46 0TW,MANCHESTER,WIGAN,GREATER MANCHESTER,184.995,1,0,0,1,...,M,M46,286.373466,285.381745,193.246849,262.010594,53.52589,-2.495181,367270.0,403360.0
4,2018-09-28,M28 3XS,MANCHESTER,SALFORD,GREATER MANCHESTER,214.995,0,1,0,1,...,M,M28,286.373466,285.381745,253.098761,262.010594,53.51677,-2.411523,372810.0,402310.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7195234,2025-01-17,NN4 8SA,NORTHAMPTON,WEST NORTHAMPTONSHIRE,WEST NORTHAMPTONSHIRE,98.000,0,1,1,0,...,NN,NN4,336.261460,360.532742,406.948231,406.948231,52.22464,-0.916339,474118.0,259044.0
7195235,2025-01-24,NN16 0SE,KETTERING,NORTH NORTHAMPTONSHIRE,NORTH NORTHAMPTONSHIRE,120.000,0,1,1,0,...,NN,NN16,336.261460,309.328992,333.187457,333.187457,52.39974,-0.721861,487058.0,278736.0
7195236,2025-01-14,NN10 0NB,RUSHDEN,NORTH NORTHAMPTONSHIRE,NORTH NORTHAMPTONSHIRE,604.500,1,0,1,0,...,NN,NN10,336.261460,262.890159,333.187457,333.187457,52.28271,-0.591401,496187.0,265885.0
7195237,2025-01-10,NN4 8TE,NORTHAMPTON,WEST NORTHAMPTONSHIRE,WEST NORTHAMPTONSHIRE,133.650,0,1,1,0,...,NN,NN4,336.261460,360.532742,406.948231,406.948231,52.22892,-0.921594,473752.0,259515.0
7195238,2025-01-27,NN15 5YL,KETTERING,NORTH NORTHAMPTONSHIRE,NORTH NORTHAMPTONSHIRE,332.000,1,0,1,0,...,NN,NN15,336.261460,309.328992,333.187457,333.187457,52.36253,-0.674499,490356.0,274655.0

In [53]:
print(loc_house_df['LONG'].min())
print(loc_house_df['LAT'].min())
print(loc_house_df['LONG'].max())
print(loc_house_df['LAT'].max())

-6.352711
49.89516
1.760167
55.79741

In [54]:
df_binary = loc_house_df
df_binary.to_csv('Pre_Outlier_removal.csv', index=False)

In [55]:
lower = df_binary['Price (Thousands)'].quantile(0.005)
upper = df_binary['Price (Thousands)'].quantile(0.995)
df_no_outliers = df_binary[(df_binary['Price (Thousands)'] >= lower) & (df_binary['Price (Thousands)'] <= upper)]
df_no_outliers.describe()

,Price (Thousands),Freehold Tenure,Leasehold Tenure,Old Build,New Build,Detached,Flat,Other Property Type,Semi-detached,Terraced,...,Quarter,Day of the Week,Area Code Average Price (Thousands),Town/City Average Price (Thousands),District Average Price (Thousands),County Average Price (Thousands),LAT,LONG,OSEAST1M,OSNRTH1M
count,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,...,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.124208e+06,7.123878e+06,7.123878e+06,7.123878e+06,7.123878e+06
mean,3.298715e+02,7.683223e-01,2.316777e-01,8.882258e-01,1.117742e-01,2.339497e-01,1.779576e-01,4.700200e-02,2.681612e-01,2.729296e-01,...,2.504003e+00,2.694955e+00,3.773255e+02,3.779384e+02,3.760113e+02,3.784236e+02,5.236689e+01,-1.356003e+00,4.443232e+05,2.753495e+05
std,2.788689e+02,4.219042e-01,4.219042e-01,3.150885e-01,3.150885e-01,4.233406e-01,3.824771e-01,2.116431e-01,4.430020e-01,4.454650e-01,...,1.124971e+00,1.466922e+00,2.309654e+02,2.088205e+02,2.554683e+02,1.842141e+02,1.148308e+00,1.322713e+00,9.125846e+04,1.272432e+05
min,1.800000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,...,1.000000e+00,0.000000e+00,1.617630e+02,8.072185e+01,1.283311e+02,1.283311e+02,4.989516e+01,-6.352711e+00,8.789700e+04,8.478000e+03
25%,1.650000e+02,1.000000e+00,0.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,...,1.000000e+00,2.000000e+00,2.450129e+02,2.436912e+02,2.379657e+02,2.454581e+02,5.146235e+01,-2.242565e+00,3.837730e+05,1.749820e+05
50%,2.600000e+02,1.000000e+00,0.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,...,3.000000e+00,3.000000e+00,3.152139e+02,3.133093e+02,3.216065e+02,3.276804e+02,5.219468e+01,-1.382798e+00,4.414290e+05,2.563110e+05
75%,3.999950e+02,1.000000e+00,0.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,...,4.000000e+00,4.000000e+00,4.248719e+02,4.306231e+02,4.318894e+02,4.223783e+02,5.337909e+01,-2.682540e-01,5.191460e+05,3.872290e+05
max,3.000000e+03,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,...,4.000000e+00,6.000000e+00,3.940892e+03,1.651318e+03,5.344404e+03,8.149508e+02,5.579741e+01,1.760167e+00,6.554250e+05,6.560140e+05

In [56]:
df_no_outliers.to_csv('ETL_Final.csv', index=False)